part = [0, 1, 3, 6, 10, 15, 21, 28, 36, 45, 0]
s, e = input().split()
s = str(max(int(s)-1, 0))
def call(s):
    global part
    l = len(s)
    r = 0
    for i in range(l):
      r += (part[9]*int(s[:i] if i else 0)+part[int(s[i])-1])*10**(l-i-1) + int(s[i])*(int(s[i+1:] if i+1<l else 0)+1)
    return r
print(call(e)-call(s))
'''
24 ab
->
 0  1  2  3  4  5  6  7  8  9
10 11 12 13 14 15 16 17 18 19
20 21 22 23 24
 1의 자리:0~9*2 + 0~4
10의 자리:0~1*10 + 2*5
 1의 자리:0~9*a + 0~b
10의 자리:0~(a-1)*10 + a*(b+1)

356 abc
->
  1의 자리:0~9*35*1 + 0~5*1 + 6
 10의 자리:0~9*3*10 + 0~4*10  + 5*7
100의 자리:           0~2*100 + 3*57

300 abc
100의 자리:         + 0~3*100 + 3*1
 10의 자리:0~9*3*10 + 0~0*10 + 3*1
  1의 자리:0~9*30*1 + 0~0 + 0
'''